#+STARTIP: overview
* Basic Settings
#+BEGIN_SRC emacs-lisp
   (setq inhibit-startup-message t)
   (tool-bar-mode -1)
   (tool-bar-mode -1)

   (setq use-package-always-ensure t)

   (setq confirm-kill-emacs nil)
   (global-font-lock-mode t)

   (use-package auto-compile
     :config (auto-compile-on-load-mode))

   (setq load-prefer-newer t)

   (use-package try
     :ensure t)

   (use-package which-key
     :ensure t
     :config (which-key-mode))

  ;; Font
  (set-face-attribute 'default nil :font "MesloLGS NF" :height 115)

  (global-hl-line-mode t)
  (tool-bar-mode 0)
  (menu-bar-mode 0)
  (scroll-bar-mode -1)

  (set-window-scroll-bars (minibuffer-window) nil nil)
  (setq frame-title-format '((:eval (projectile-project-name))))

  (defun hrs/kill-current-buffer ()
  "Kill the current buffer without prompting."
  (interactive)
  (kill-buffer (current-buffer)))

  (global-set-key (kbd "C-x k") 'hrs/kill-current-buffer)
  (global-set-key (kbd "C-x C-b") 'ibuffer)
  (add-to-list 'default-frame-alist '(fullscreen . maximized))

  (add-hook 'c++-mode-hook #'modern-c++-font-lock-mode)

#+END_SRC


#+RESULTS:
| lsp | modern-c++-font-lock-mode |

** Definition Jumping    
   Few packages for navigating through definitions in a block of source code. 
   #+BEGIN_SRC emacs-lisp
     (use-package dumb-jump
       :config
       (add-hook 'xref-backend-functions #'dumb-jump-xref-activate))

     (use-package ivy-xref
       :init
       (setq xref-show-definitions-function #'ivy-xref-show-defs))

     (use-package let-alist)
   #+END_SRC
   

   #+RESULTS:
   es
   
